Here are the plans:

<details>
<summary>Facilitator, apply-cluster-bootstrap</summary>

```
Terraform will perform the following actions:

  # module.gke[0].random_string.kms_id will be created
  + resource "random_string" "kms_id" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + google_kms_key_ring_id = "projects/prio-dcook-dev/locations/us-west1/keyRings/prio-dcook-facil-kms-keyring"
```

</details>

<details>
<summary>Facilitator, apply</summary>

```
Terraform will perform the following actions:

  # module.fake_server_resources[0].google_service_account_iam_member.integration_test_identity_to_my_sum_part_bucket_writer_token_creator will be created
  + resource "google_service_account_iam_member" "integration_test_identity_to_my_sum_part_bucket_writer_token_creator" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:prio-qtuiemalbaikxjci@prio-dcook-dev.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = "projects/prio-dcook-dev/serviceAccounts/prio-dcook-facil-sum-writer@prio-dcook-dev.iam.gserviceaccount.com"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

(This is the same non-convergence I've been seeing here, unrelated to this change)
</details>